* countdown definition
  + =number= is never assigned to in the body of the function
#+begin_src js :results output :exports both
  function countdown(number) {
    if(number === 0) return console.log('happy new year!');
    console.log(number);
    return countdown(number - 1);
  }

  countdown(2);
#+end_src

#+RESULTS:
: 2
: 1
: happy new year!

*** countdown_0
#+name: countdown-0
#+begin_src js :eval never :noweb yes
  function countdown_0() {
    console.log('happy new year!');
  }
#+end_src
#+begin_src js :noweb yes :results output :exports both
  <<countdown-0>>
  countdown_0();
#+end_src

#+RESULTS:
: happy new year!

*** countdown_1
#+name: countdown-1
#+begin_src js :eval never :noweb yes
  function countdown_1() {
    console.log(1);
    console.log('happy new year!');
  }
#+end_src
#+begin_src js :noweb yes :results output :exports both
  <<countdown-1>>
  countdown_1();
#+end_src

#+RESULTS:
: 1
: happy new year!

*** countdown_2
#+name: countdown-2
#+begin_src js :eval never :noweb yes
  function countdown_2() {
    console.log(2);
    console.log(1);
    console.log('happy new year!');
  }
#+end_src
#+begin_src js :noweb yes :results output :exports both
  <<countdown-2>>
  countdown_2();
#+end_src

#+RESULTS:
: 2
: 1
: happy new year!

*** countdown_3
#+name: countdown-3
#+begin_src js :eval never :noweb yes
  function countdown_3() {
    console.log(3);
    console.log(2);
    console.log(1);
    console.log('happy new year!');
  }
#+end_src
#+begin_src js :noweb yes :results output :exports both
  <<countdown-3>>
  countdown_3();
#+end_src

#+RESULTS:
: 3
: 2
: 1
: happy new year!

*** countdown_4
#+name: countdown-4
#+begin_src js :eval never :noweb yes
  function countdown_4() {
    console.log(4);
    console.log(3);
    console.log(2);
    console.log(1);
    console.log('happy new year!');
  }
#+end_src
#+begin_src js :noweb yes :results output :exports both
  <<countdown-4>>
  countdown_4();
#+end_src

#+RESULTS:
: 4
: 3
: 2
: 1
: happy new year!

*** countdown_4 with countdown_3
#+name: countdown-4-3
#+begin_src js :eval never :noweb yes
  <<countdown-3>>
  function countdown_4() {
    console.log(4);
    countdown_3();
  }
#+end_src
#+begin_src js :noweb yes :results output :exports both
  <<countdown-4-3>>
  countdown_4();
#+end_src

#+RESULTS:
: 4
: 3
: 2
: 1
: happy new year!

*** countdown_3
#+name: countdown-3-2
#+begin_src js :eval never :noweb yes
  <<countdown-2>>
  function countdown_3() {
    console.log(3);
    countdown_2();
  }
#+end_src
#+begin_src js :noweb yes :results output :exports both
  <<countdown-3-2>>
  countdown_3();
#+end_src

#+RESULTS:
: 3
: 2
: 1
: happy new year!

*** countdown_2
#+name: countdown-2-1
#+begin_src js :eval never :noweb yes
  <<countdown-1>>
  function countdown_2() {
    console.log(2);
    countdown_1();
  }
#+end_src
#+begin_src js :noweb yes :results output :exports both
  <<countdown-2-1>>
  countdown_2();
#+end_src

#+RESULTS:
: 2
: 1
: happy new year!

*** countdown_1
#+name: countdown-1-0
#+begin_src js :eval never :noweb yes
  <<countdown-0>>
  function countdown_1() {
    console.log(1);
    countdown_0();
  }
#+end_src
#+begin_src js :noweb yes :results output :exports both
  <<countdown-1-0>>
  countdown_1();
#+end_src

#+RESULTS:
: 1
: happy new year!

*** countdown_0
#+name: countdown-0-again
#+begin_src js :eval never :noweb yes
  function countdown_0() {
    console.log('happy new year!');
  }
#+end_src
#+begin_src js :noweb yes :results output :exports both
  <<countdown-0-again>>
  countdown_0();
#+end_src

#+RESULTS:
: happy new year!

** write the recursive version of countdown
#+name: countdown-n
#+begin_src js :eval never :noweb yes
  function countdown(number) {
    if(number === 0) return console.log('happy new year!');
    console.log(number);
    countdown(number - 1);
  }
#+end_src
#+begin_src js :noweb yes :results output :exports both
  <<countdown-n>>
  countdown(5);
#+end_src

#+RESULTS:
: 5
: 4
: 3
: 2
: 1
: happy new year!
